/*
★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆

　メッシュ分割数などの定数の定義

★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆

*/
#ifndef DEFINE_OPT_SETTING
#define DEFINE_OPT_SETTING

#define _CRT_SECURE_NO_WARNINGS


/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/
/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/
/*  MPI実行時用のDefine                    */
/*  MPI用にコンパイルするとき、これを定義  */
//#define MPI_RUN_OPT_MODE_SETTINGS
/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/
/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/


/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/
/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/
/*  最適化アルゴリズムの選択                    */
#define USING_CROSS_AREX
//#define USING_CROSS_REX_STAR

/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/
/*=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=*/



#include <vector>
#include <string>
#include <iostream>
#include <BaseDefines.hpp>

using namespace std;

#include "RGeneS.hpp"

/*
//=======================================================
// ■ OptSettings
//=======================================================
// 最適化の定数系管理staticクラス
//=======================================================*/
class OptSettings{
public:
	static int GENE_SIZE;						/* 遺伝子数 */
	static int NUM_FEATURE;						/* 覚えておく特性値の数 */
	static int PARA_OMP_CALC_NUM;				/* 並列計算実施数（OpenMP） */

	static int TOTAL_SIZE;						/* 初期個体数 */
	static int GENERATION_SIZE;					/* 世代数 */
	static bool USE_ORACLE;						/* オラクル制約処理を使うか */
	static double ORACLE_PARAMETERS;			/* オラクル制約のパラメータ */
	static vector<string> FEATURES_NAME;		/* 特性値のお名前（RGene書き出し時などに利用） */
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/	
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/	
	static void opt_set_read();					/* 最適化設定読み取り */
	/* オラクルが返す情報の数（F+Fごとのresidual + features） */
	static int get_total_oracle_features(){
		return(2+NUM_FEATURE);
	};
	/* RGeneのStatic変数をセットする */
	static void setRGeneStaticParas();
	/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/	
	/*
	//===========================================================
	//===========================================================
	// ● REXstar定数
	//=========================================================== */
	//=========================================================== */
	class REX_Settings{
	public:
		static int NUM_CHILD;					/* REXの子個体生成数 */
		static int PARENT_NUM;					/* REXが使う親個体数 */
		/**/
		static void opt_set_read_rex();			/* REXstarの設定読み取り */
	};
};


#endif


